import '../styles.css';
import colors from './colors';

// Напиши скрипт, который после нажатия кнопки Start,
// раз в секунду меняет цвет фона body на случайное значение
// из массива используя инлайн-стиль.
// При нажатии на кнопку Stop,
// изменение цвета фона должно останавливаться.

// ⚠️ Учти, на кнопку Start можно нажать бесконечное количество раз.
// Сделай так, чтобы пока изменение темы запушено,
// кнопка Start была не активна.

// Для генерации случайного числа (индекс элемента массива цветов),
//  используй функцию randomIntegerFromInterval.

const randomIntegerFromInterval = (min, max) => {
  return Math.floor(Math.random() * (max - min + 1) + min);
};
